Courses/7140/Projects/7140-homework-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Adv Software Eng: HW2 Summer 2016</title>
<!-- 2016-07-11 Mon 00:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CS7140 Software Engineering Lecture"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../Top/">CS 7140</a>
</div>
<div id="content">
<h1 class="title">Adv Software Eng: HW2 Summer 2016</h1>
<p>
Home work in this course is done individually, without help from
others.  The due date is announced on the course home page.
</p>

<p>
In this home work we need a couple of class files, in Java or Scala,
as the base.  (i) You are welcome to use any two non-trivial class
files from the code <b>you</b> designed/ developed for the project.
Members of a team must select different classes.  You are welcome to
include the results of this Homework2 in the Testing and Debugging
Report of the course project.  (ii) Alternately, all of you can also
choose the SmallSet.java (<a href="../Lectures/FormalMethods/SmallSet.java">Java Source</a>, <a href="../Lectures/FormalMethods/SmallSet.java.html">htmlized</a>, <a href="../Lectures/FormalMethods/SmallSet.java.pdf">pdf</a>) single file.
You are also welcome to use <i>your</i> version of SmallSet.java instead.
You can vary the choice on a per item basis.
</p>

<ol class="org-ol">
<li>(25 points) [<a href="../Lectures/Design/vhll.html">Literate Programming</a>] Express the chosen class file(s) as a
literate program (LP).  The LP version should exemplify the OOP
design by contract principles.
</li>

<li>(25 points) [Assert] This part of the home work is focussed on
gaining some experience with the use of Java asserts.  Thoroughly
document the chosen class file(s) using Java assertions for
invariants, requires, ensures, assignable, &#x2026; .  
</li>

<li>(25 points) [<a href="../Lectures/Testing/index.html">JUnit or TestNG</a>] This part of the home work is
focussed on systematic testing of the chosen file(s).  Use a JUnit
Plugin or a TestNG plugin (in Eclipse, or Intellij Idea).
</li>

<li>(25 points) [<a href="../Lectures/Testing/index.html">FindBugs or PMD</a>] This part of the home work is
focussed on gaining experience with the use of a static source code
analysis tools.  Examine closely the reports produced by the tool.
Which of the items do you agree with?  How did you resolve the
issues?
</li>

<li>(00 points) Please maintain a journal for this homework.  Submit a
summary.
</li>
</ol>

<p>
Turn in your answers on <code>thor.cs.wright.edu</code> as in <code>~cs714000/turnin
HW2 hw2.pdf tarBallName</code>
</p>

<p>
The <code>hw2.pdf</code> should have five sections, devoted to each of the above
items.  Include overviews for each.  Other than the source code files,
put <b>everything else</b> &#x2013; overviews, diagrams, screen shots &#x2013; together
and produce one <code>hw2.pdf</code> file.  Include the source code files in
the tar-ball.
</p>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2016-07-11
</div>
</body>
</html>
